wyniki_50G_article/fio_results_zfs_hdd/block_size_4096/lab-sec-11/fio_seq_read_article_test_output.txt
seq_read_article_test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
seq_read_article_test: Laying out IO file (1 file / 51200MiB)

seq_read_article_test: (groupid=0, jobs=1): err= 0: pid=34183: Sat Apr 19 16:20:53 2025
  read: IOPS=37.7k, BW=147MiB/s (155MB/s)(25.9GiB/180000msec)
    slat (nsec): min=1562, max=1399.5M, avg=24366.76, stdev=732899.53
    clat (nsec): min=328, max=253728, avg=1390.20, stdev=850.89
     lat (nsec): min=1909, max=1399.5M, avg=25756.96, stdev=733093.38
    clat percentiles (nsec):
     |  1.00th=[  374],  5.00th=[  980], 10.00th=[ 1004], 20.00th=[ 1032],
     | 30.00th=[ 1064], 40.00th=[ 1224], 50.00th=[ 1320], 60.00th=[ 1368],
     | 70.00th=[ 1400], 80.00th=[ 1480], 90.00th=[ 2008], 95.00th=[ 2096],
     | 99.00th=[ 3184], 99.50th=[ 7520], 99.90th=[11968], 99.95th=[13888],
     | 99.99th=[20608]
   bw (  KiB/s): min=16128, max=226304, per=100.00%, avg=151877.59, stdev=24385.23, samples=357
   iops        : min= 4032, max=56576, avg=37969.38, stdev=6096.31, samples=357
  lat (nsec)   : 500=1.60%, 750=0.39%, 1000=6.23%
  lat (usec)   : 2=81.70%, 4=9.46%, 10=0.34%, 20=0.26%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=6.86%, sys=34.13%, ctx=26000, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6793012,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=147MiB/s (155MB/s), 147MiB/s-147MiB/s (155MB/s-155MB/s), io=25.9GiB (27.8GB), run=180000-180000msec